fortunka/app/controllers/fortunes_controller.rb

  def index
   @fortunes = Fortune.order('created_at DESC').page(params[:page]).per_page(4)
---
SELECT "fortunes".* FROM "fortunes" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "fortunes"

  def show
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @fortune = Fortune.new(params[:fortune])
    @fortune.save
---
INSERT INTO "fortunes" ("created_at", "data", "quotation", "source", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 04 Dec 2012 18:02:34 UTC +00:00], ["data", Tue, 04 Dec 2012], ["quotation", "fdhdh"], ["source", "gfger"], ["updated_at", Tue, 04 Dec 2012 18:02:34 UTC +00:00]]

  def update
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "fortunes" WHERE "fortunes"."id" = ?  [["id", 5]]